04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/planingHullW3/system/refineMeshDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      refineMeshDict.1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

coordinates
{
    type        global;

    e1          (1 0 0);
    e2          (0 1 0);

    directions  (e1 e2);
}

zones
{
    level1
    {
        type    box;
        box     (-4.0 -3.0 -2) (4.0 0 3.0);
    }

    level2
    {
        type    box;
        box     (-3.0 -2.0 -1.4) (3.5 0 1.7);
    }

    level3
    {
        type    box;
        box     (-2.5 -0.8 -0.6) (3.0 0 0.8);
    }

    level4
    {
        type    box;
        box     (-2.0 -0.6 -0.4) (2.5 0 0.5);
    }

    level5
    {
        type    box;
        box     (-1.0 -0.4 -0.2) (2.2 0.0 0.4);
    }

    level6
    {
        type    box;
        box     (-0.8 -0.4 -0.1) (2.1 0.0 0.35);
    }

    level7
    {
        type    box;
        box     (-0.2 -0.25 -0.05) (2.05 0.0 0.3);
    }
}

// ************************************************************************* //
