04_OpenFoam/_Tut_02/OpenFOAM-14/incompressibleVoF/planingHullW3/Allmesh.1
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication surfaceTransformPoints \
    "translate=(-0.586 0 -0.156), \
    Ry=-3.485, \
    translate=(0.586 0 0.156)" \
    constant/geometry/w3_orig.stl constant/geometry/w3.stl

runApplication surfaceFeatures

runApplication blockMesh -dict system/blockMeshDict.1

runApplication decomposePar -noFields

runParallel refineMesh -dict system/refineMeshDict.1

runParallel snappyHexMesh -dict system/snappyHexMeshDict.1

runParallel renumberMesh -noFields

#------------------------------------------------------------------------------
